{
  "main": {
    "name": "Eric Ho",
    "occupation": "Software Engineer",
    "description": "I type in a glorified word document for fun",
    "image": "profilepic.jpg",
    "bio": "Software developer based out of Florida. I love building and taking on exciting projects that challenge my current skill set, whether it be a computer program, home imporovment tasks, automation assignments, or anything in between! Music is such a passion for me and I want to learn to play as many instruments as possible. I'm especially a fan of hip-hop, punk rock, indie, and electronic. I am an avid basketball fan (go heat!) and ameratur player. At the end of the day, I want my career to be something I can look back on and be proud of. ",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "ericvho888@gmail.com",
    "phone": "813-505-3230",
    "address": {
      "street": "(Your Street)",
      "city": "Tampa",
      "state": "FL",
      "zip": "33647"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "http://timbakerdev.com",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/eric-ho-181368181/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/triple3567",
        "className": "fa fa-github"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/erictheho/",
        "className": "fa fa-instagram"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "University of Florida",
        "degree": "BS in Computer Science, Minor in Economics",
        "graduated": "May 2022",
        "description": "In my time at UF, I learned a lot of conputer related theory in courses such as operating systems, data structures and algorithms, deep learning for comuputer graphics, and penetration testing for ethical hacking. I completed many projects that sharpened my logical reasoning, and programming skills. However, The most valuable asset I gained were the friends and life long connections I made."
      }
    ],
    "work": [
      {
        "company": "ADAMUS Lab @ The University of Florida",
        "title": "Software Engineer",
        "years": "August 2020 - August 2021",
        "description": "Under the direction of Dr. Riccardo Belivaquia, the ADvanced Autonomous MUltiple Spacecraft laboratory (ADAMUS) bridges the gap between computer numerical simulations and actual orbital flight. I worked on the Passive Thermal Coating Observatory Operating in Low-Earth Orbit (PATCOOL). PATCOOL is a NASA sponsered cubsat whos mission was to investigate the feasibility of using a cryogenic selective surface coating as a new, more efficient way of passively cooling components in space.",
        "description2": "Our software team consisted of 3 undergrad students tasked with handling data and commands of hardware component, communication between the satellite and ground station while minimizing the volume of data transfered, and ensuring integrety at each stage of the boot sequence. I developed in c++ and python using the ROS framework written, as well as using bash and sqlite3 for various parts of the software packages. Working closely with the electrical team, I learned how to debug PCBs and preform hardware-in-the-loop testing."
      },
      {
        "company": "Raymond James Financial",
        "title": "IT Intern ",
        "years": "May 2020 - August 2020",
        "description": "Working at Raymond James taught me how to work with a large team in a scrum based enviroment, and how communication between communication between developers is vital. I completed debugging tasks for a web service facing financial advisors, and created ER diagrams for the databases. My internship started right at the emergence of virtual work due to COVID-19, so I assisted my colleagues that had trouble migrating to an online environment."
      },
      {
        "company": "MYOLYN",
        "title": "Intern",
        "years": "May 2019 - August 2019",
        "description": "My main task here was a basic machine learning model which took survey data from the company's website and predicted which customers were most likely to buy our product. I also assisted in the transfer of data when the company was switching inventory management systems. I learned how small companies operate, and witnessed the decision making process that new companies must make everyday."
      },
      {
        "company": "Publix Supermarkets",
        "title": "Cashier and Bagger ",
        "years": "May 2016 - August 2018",
        "description": "Working at a grocery store taught me how to interact with a wide range of people. Having to keep a calm and collected demeanor while serving people from all walks of life is a valuable skill that will help me forever."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Illustrator",
        "level": "55%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "VueJs",
        "level": "50%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "PATCOOL Cubesat",
        "category": "Article for UF PATCOOL Cubesat",
        "image": "PATCOOL.jpg",
        "url": "https://www.alligator.org/article/2021/11/uf-astronomy-nasa-aerospace-engineering"
      },
      {
        "title": "SoundStage",
        "category": "A VST plugin for music producers",
        "image": "SoundStageUI.png",
        "url": "https://youtu.be/Yupfm9FMOlY"
      },
      {
        "title": "SoundStage",
        "category": "The code review for SoundStage",
        "image": "SoundStageDiagram.jpg",
        "url": "https://youtu.be/4RV7HyizQNE"
      },
      { 
        "title": "Imprint Genius Web Application",
        "category": "Internal web application build for Imprint Genius as a school project",
        "image": "ImprintGenius.jpg",
        "url": "https://youtu.be/cmAIgyAdrw0"
      }
      
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "One of the most creative, diligent, light-hearted, and intelligent men of my generation.",
        "user": "Mahatma Gandhi"
      },
      {
        "text": "WOW he's so handsome and strong!!!",
        "user": "Jennifer Lawrence "
      },
      {
        "text": "He's like a brother to me.",
        "user": "My brother "
      }
    ]
  }
}
